# ОБЩИЕ КОНСТАНТЫ
# <--------------

# Ограничение на вывод символов:
CHAR_LIMIT = 20

# ------------->

# КОНСТАНТЫ ДЛЯ МОДЕЛИ РЕЦЕПТА
# <--------------------

# Ограничение на длину названия рецепта:
MAX_RECIPE_NAME_LEN = 128

# Минимальное время приготовления:
MIN_COOKING_TIME = 1

# Максимальное время приготовления:
MAX_COOKING_TIME = 32767

# -------------------->

# КОНСТАНТЫ ДЛЯ МОДЕЛИ ТЕГА
# <-----------------

# Ограничение на длину названия тега:
MAX_TAG_NAME_LEN = 64

# Ограничение на длину слага тега:
MAX_TAG_SLUG_LEN = 128

# ----------------->

# КОНСТАНТЫ ДЛЯ МОДЕЛИ ИНГРЕДИЕНТА
# <-----------------

# Ограничение на длину названия ингредиента:
MAX_INGREDIENT_NAME_LEN = 128

# Ограничение на длину единицы измерения:
MAX_INGREDIENT_MU_LEN = 32

# ----------------->

# КОНСТАНТЫ ДЛЯ МОДЕЛИ ИНГРЕДИЕНТА В РЕЦЕПТЕ
# <-----------------

# Минимальное кол-во ингредиентов:
MIN_INGREDIENTS_AMOUNT = 1

# Максимальное кол-во ингредиентов:
MAX_INGREDIENTS_AMOUNT = 32767

# ----------------->

# КОНСТАНТЫ ДЛЯ АДМИНКИ ИНГРЕДИЕНТА В РЕЦЕПТЕ
# <-----------------

# Кол-во дополнительных пустых строк в админке:
EXTRA = 0

# Минимальное количество строк:
MIN_NUM = 1

# ----------------->
